{"_path":"/blog/a_journey_at_sc24","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"A Journey at SC24","description":"This article is a firsthand account of my journey as a student volunteer at the Supercomputing Conference 2024 (SC24), the largest event dedicated to high-performance computing (HPC). It explores the technical innovations, inspiring keynotes, and collaborative spirit that make SC a unique experience. Through personal anecdotes, I share how the conference helped me organize my thoughts, connect with like-minded peers, and discover my path in the vast world of HPC. From the awe of seeing groundbreaking technologies to the importance of building a supportive community.","author":"Lorenzo Piarulli","gh_nickname":"lor3ny","image":"https://media.licdn.com/dms/image/v2/D4D22AQG8XthITyx-9A/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1733404270188?e=1736380800&v=beta&t=CdUYx0NBso8HVul7hHwNqaTe0HPPhcUdOw5g88Kj-iw","date":"2024-12-09","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"a-journey-at-sc24"},"children":[{"type":"text","value":"A Journey at SC24"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This year, our juice was taken to one of the most important conferences in the world in the remote and exotic Atlanta, in the USA. Despite the temptation to invest all of our limited savings in cutting-edge technologies such as immersion cooling systems, 8-GPU racks, enormous hamburgers, or state-of-the-art accelerators, we resisted. Navigating through numerous temptations, we are truly thrilled to have been part of such a pioneering and outstanding community."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hi everyone, I'm Lorenzo. This year, I had the privilege of volunteering as a student at the Supercomputing conference '24 (SC24). SC24 is renowned as the largest gathering focused on high-performance computing (HPC), attracting researchers from those working on the cutting edge of supercomputing hardware to scientists utilizing HPC systems for their scientific applications. The conference features a diverse array of events, including technical paper presentations, workshops, panels, tutorials, Birds of a Feather (BoF) sessions, and keynotes. Each type of event has its own unique format, ranging from formal paper presentations to open discussions with recognized experts in the field. The technical events, such as paper presentations, workshops, and Birds of a Feather (BoFs), play a crucial role in showcasing the year's groundbreaking discoveries that are shaping the future of how supercomputers are designed and utilized. They serve as the foundation of the research community and the backbone of the conference, driving innovation and collaboration in the field.\nPanels are probably some of the most exciting events at the conference. They’re open discussions on big, important topics that can range from deep technical insights to inclusivity and work-life balance. It’s awesome to join these sessions and watch research legends share their knowledge, breaking things down to help you better understand what’s happening in this massive field. They’re also there to guide you and maybe even help you find your own path forward\nThe tempting ring is hidden on the exhibit floor, a vibrant hub where companies, national laboratories, academic institutions, and open-source foundations showcase their stands. Here, attendees can explore the latest, most powerful, and most advanced technologies. This includes groundbreaking, powerful architectures, new enormous and noisy cooling systems that could cool down Vhagar, big racks that can fuse multiple bizarre accelerators, and more juicy stuff. The exhibit opening is a great chance to meet people, make new connections, learn about cool research, and even find opportunities for future collaborations."}]},{"type":"element","tag":"figure","props":{},"children":[{"type":"text","value":"\n    "},{"type":"element","tag":"img","props":{"src":"https://media.licdn.com/dms/image/v2/D4D22AQG8XthITyx-9A/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1733404270188?e=1736380800&v=beta&t=CdUYx0NBso8HVul7hHwNqaTe0HPPhcUdOw5g88Kj-iw","alt":""},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tag":"figcaption","props":{},"children":[{"type":"text","value":"First plenaria of the conference."}]}]},{"type":"element","tag":"h3","props":{"id":"the-keynote"},"children":[{"type":"text","value":"The Keynote:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of the highlights of every SC conference is the keynote. It’s a speech delivered on the main stage by a distinguished researcher. This year, we had the privilege of hearing from Nicola Fox, NASA’s associate administrator, who talked about how supercomputers are revolutionizing the way NASA conducts its missions and simulations, making them more accurate and effective.\nHer talk was incredible—it started with the Voyager Space Probe, which has now ventured into interstellar space. From there, she covered the discovery of new exoplanets, and the search for simple life on Europa, one of Jupiter’s moons, and wrapped up with the significance of simulating supernovae, dying stars, and black holes.\nIt was, without a doubt, one of the most impactful speeches I’ve ever heard. It inspired me to pursue a research career in this field, focusing on accelerating scientific applications to enable groundbreaking discoveries, improve people’s lives, and help build a better future."}]},{"type":"element","tag":"h2","props":{"id":"sc24-is-not-only-nerdy-stuff-its-also-community"},"children":[{"type":"text","value":"SC24 is not only nerdy stuff, It's also community"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This event has been a milestone in my student journey, giving me a deeper understanding of the HPC world and the chance to meet and talk with the brilliant minds who build and use these incredible systems. As a student volunteer, one of the coolest perks is being able to wander around freely and soak in all the amazing things happening at the conference.\nIt’s like stepping into the multiverse of HPC. One moment, you’re diving into colossal simulations of supernovae, black holes, and planets that seem to breathe with life. The next, you’re in microcosmic realms of particles, molecules, proteins, and the very essence of life itself. It’s mind-blowing to see how HPC reshapes our understanding of the universe or how it revolutionizes life on Earth, enabling the creation of groundbreaking medicines to tackle the most enigmatic and devastating diseases. It’s science fiction come to life, powered by computation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During the conference, you get to collaborate with your fellow student volunteers, and for me, this collaboration was invaluable. It helped me forge new friendships with people who share my values, vision, and passions. One of the best parts is hanging out with students from all over the world, geeking out about your thesis or nerdy projects, and realizing they either totally relate to your excitement or are genuinely eager to hear every word of it.\nI met some truly amazing people who are unapologetically passionate about what they do. This community feels like a safe haven, especially for those who might struggle to fit into a world that sometimes sees computer geeks as outsiders. Here, everyone is valued for who they are. It’s a place where you can share your ideas, your struggles, or even your latest D&D campaign without fear of judgment. It’s like finding your own fellowship of the ring—except this one runs on algorithms, GPUs, and an endless supply of curiosity."}]},{"type":"element","tag":"figure","props":{},"children":[{"type":"text","value":"\n    "},{"type":"element","tag":"img","props":{"src":"https://media.licdn.com/dms/image/v2/D4D22AQG6l08wlSiQ7w/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1733404277053?e=1736380800&v=beta&t=b5A2LSf-9MMTi3MVCP2nh3c8c7imGeroHz4sBDjNc80","alt":""},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tag":"figcaption","props":{},"children":[{"type":"text","value":"All the students volunteers."}]}]},{"type":"element","tag":"h2","props":{"id":"yes-i-loved-it"},"children":[{"type":"text","value":"Yes, I loved it"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I've arrive at SC24 as a student with a million unordered thoughts swirling in my head. But through conversations with students like me, I managed to organize those ideas and start finding my place in the vast world of HPC. It gave me a clear vision of the many paths HPC offers—and helped me figure out which ones I want to explore and improve.\nLooking back, SC24 taught me countless things, but two stand out that I’ll carry with me forever. First, PlumJuice began as a labor of love—a way to share our secret nerdy passions for fast, interconnected, and “tasty” ideas. SC24 showed me just how important it is to build a community that understands and embraces your feelings, passions, and even fears.\nSecond, SC24 reminded me of the profound importance of research in our field. It takes people willing to dedicate part of their lives to chasing what often feels like fantasies and magic. But those fantasies can lead to groundbreaking discoveries that change lives and reshape how we relate to the world. HPC can be the bridge between imagination and reality—a tool to turn dreams into revolutions.\nI’m thrilled to join this incredible community and dedicate my efforts to the HPC field. I don’t care about where it takes me or the recognition I might get. All I want is to work on something meaningful and make a difference for others. After all, in the words of a wise wizard, “All we have to decide is what to do with the time that is given us.” And I’ve made my choice."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"the-keynote","depth":3,"text":"The Keynote:"},{"id":"sc24-is-not-only-nerdy-stuff-its-also-community","depth":2,"text":"SC24 is not only nerdy stuff, It's also community"},{"id":"yes-i-loved-it","depth":2,"text":"Yes, I loved it"}]}},"_type":"markdown","_id":"content:blog:a_journey_at_sc24.md","_source":"content","_file":"blog/a_journey_at_sc24.md","_stem":"blog/a_journey_at_sc24","_extension":"md"}